<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Apple Time Machine archive and wraps it into a pkg.</string>
		<key>Identifier</key>
		<string>com.github.znerol.pkg.TimeMachineExporter</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>TimeMachineExporter</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.znerol.download.TimeMachineExporter</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>pkgdirs</key>
					<dict>
						<key>Library</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Library</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%pkgroot%/Library/timemachine_exporter*</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileMover</string>
				<key>Arguments</key>
				<dict>
					<key>source</key>
					<string>%found_filename%</string>
					<key>target</key>
					<string>%pkgroot%/Library/TimeMachineExporter</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>version</key>
						<string>%version%</string>
						<key>id</key>
						<string>io.prometheus.TimeMachineExporter</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Library</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
