<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
		<string>Downloads the latest Grafana Promtail from GitHub.</string>
	<key>Identifier</key>
	<string>com.github.znerol.download.PromtailAppleSilicon</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PromtailAppleSilicon</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The Promtail recipes have been consolidated into a single set that supports multiple architectures. Please switch to the new recipes and override the ARCH input variable as desired. These Apple Silicon-specific recipes are deprecated and will be removed in the future.</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>promtail.darwin-arm64.zip</string>
				<key>github_repo</key>
				<string>grafana/loki</string>
				<key>latest_only</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
