<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Packages a launch daemon plist for Grafana Promtail.</string>
		<key>Identifier</key>
		<string>com.github.znerol.pkg.PromtailLaunchDaemon</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>PromtailLaunchDaemon</string>
			<key>VERSION</key>
			<string>1.3</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgroot</key>
						<string>%RECIPE_DIR%/PromtailLaunchDaemon/payload</string>
						<key>scripts</key>
						<string>%RECIPE_DIR%/PromtailLaunchDaemon/scripts</string>
						<key>pkgname</key>
						<string>%NAME%-%VERSION%</string>
						<key>version</key>
						<string>%VERSION%</string>
						<key>id</key>
						<string>com.grafana.promtailLaunchDaemon</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Library</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
